Positive Testing

CISSP Glossary : สิ่งที่กำหนดว่า applications ของคุณทำงานได้ตามที่คาดหวัง
ChatGPT : กระบวนการหรือวิธีการใดๆ ที่ใช้ในการตรวจสอบและยืนยันว่าโปรแกรมหรือแอปพลิเคชันที่พัฒนาขึ้นทำงานตามความคาดหวังหรือข้อกำหนดที่กำหนดไว้
Gemini : การทดสอบระบบโดยการป้อนข้อมูลที่ถูกต้องและเป็นไปตามข้อกำหนดที่ระบบออกแบบมา เพื่อให้ระบบทำงานได้ตามที่คาดหวังและให้ผลลัพธ์ที่ถูกต้อง

Source 2
geeksforgeeks.org : คือประเภทของการทดสอบซอฟต์แวร์ที่ดำเนินการโดยตั้งสมมติฐานว่าทุกอย่างจะเป็นไปตามที่คาดหวัง โดยดำเนินการภายใต้สมมติฐานว่าจะมีเฉพาะสิ่งที่ถูกต้องและเกี่ยวข้องเท่านั้น ชุดข้อมูลและฟังก์ชันอื่นๆ ทั้งหมดจะเป็นไปตามที่คาดหวัง
Chat GPT : หมายถึงการทดสอบซอฟต์แวร์ประเภทหนึ่งที่ดำเนินการโดยสมมติฐานว่า ระบบหรือแอปพลิเคชันจะทำงานได้ตามที่คาดหวังไว้ในสถานการณ์ปกติ โดยมีการป้อนข้อมูลที่ถูกต้องและอยู่ในขอบเขตที่กำหนด (valid input) รวมถึงตรวจสอบว่าโปรแกรมตอบสนองตามข้อกำหนดและไม่มีข้อผิดพลาดเกิดขึ้น
Gemini : เป็นการทดสอบซอฟต์แวร์ประเภทหนึ่งที่ดำเนินการโดยสมมติว่าทุกอย่างจะเป็นไปตามที่คาดไว้  การทดสอบนี้ดำเนินการโดยสมมติว่าจะมีเพียงสิ่งที่ถูกต้องและเกี่ยวข้องเท่านั้นที่จะเกิดขึ้น  ชุดข้อมูลและฟังก์ชันการทำงานอื่นๆ ทั้งหมดจะเป็นไปตามที่คาดไว้

Myself : คือการทดสอบที่เป็นไปตามผลคาดหวังที่เราหวังไว้ เพื่อดูว่าแอปของเราเป็นไปตามที่เรากำหนด
Daily Life : ทดลองเปิดปิดไฟ กรณีซื้อหลอดใหม่ เมื่อเปลี่ยนเสร็จจะทำการทดสอบว่าเปิดไฟ แล้วดูว่าหลอดไฟทำงานปกติ
Daily Life2 : การชิมอาหาร หลังจากทำอาหารแล้ว ต้องลองชิมเพื่อดูว่า "รสชาติออกมาตามที่เราคาดหวังหรือไม่"
